Revit 2027 API
ParameterTypeId.StructuralBeamEndAttachmentDistance Property
 "End Attachment Distance"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralBeamEndAttachmentDistance { get; }
Public Shared ReadOnly Property StructuralBeamEndAttachmentDistance As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralBeamEndAttachmentDistance {
	ForgeTypeId^ get ();
}
static member StructuralBeamEndAttachmentDistance : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace